{
  "politics": [
    {
      "title": "Trump and Musk enter bitter feud - and Washington buckles up",
      "link": "https://www.bbc.com/news/articles/c3wd2215q08o",
      "summary": "A knock-down fight between world's the richest person and the most powerful politician is playing out in public view.",
      "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
      "category": "politics",
      "confidence": 0.5227997303009033,
      "story_cluster": 1,
      "full_text": "Trump and Musk enter bitter feud - and Washington buckles up\nWhat happens when the richest person and the most powerful politician have a knock-down, drag-out fight?\nThe world is finding out – and it's not a pretty picture. Donald Trump and Elon Musk have two of the biggest megaphones, and they have now turned them on each other, as a disagreement has ballooned into a war of words.\nTrump has threatened Musk's voluminous business dealings with the federal government, which form the lifeblood of his SpaceX programme.\n\"The easiest way to save money in our budget, billions and billions of dollars, is to terminate Elon's governmental subsidies and contracts,\" Trump posted menacingly on his own social media website.\nIf Trump turns the machinery of government against Musk, the tech billionaire will feel pain. Tesla's stock price plunged by 14% on Thursday.\nIt's not a one-way street, however. After that volley, Musk called for Trump's impeachment, dared him to cut funding for his companies and countered that he was accelerating the decommissioning of his Dragon spacecraft, which the US relies on to carry American astronauts and supplies to the International Space Station.\nMusk has near limitless resources to respond, including by funding insurgent challengers to Republicans in next year's elections and primaries. And late on Thursday afternoon, he said he was dropping the \"really big bomb\" – suggesting without evidence that Trump appears in unreleased files related to late sex offender Jeffrey Epstein.\nHis press secretary, Karoline Leavitt, offered only a tepid pushback to Musk's allegations and accusations.\n\"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill because it does not include the policies he wanted,\" she said.\nMusk may not win a fight against the whole of Trump's government, but he could exact a high political - and personal - price for Trump and the Republicans.\nTrump, perhaps aware of this, appeared to tamp down the heat a bit by the end of the day, avoiding comment on Musk during a public appearance at a White House police appreciation event and posting a message on Truth Social that said he didn't mind \"turning against him\" but wishes he had quit government service months ago. He then pivoted to boosting of his \"big, beautiful\" tax and spending legislation.\nIt's difficult to envision an easy walk-down after Thursday's heat, however.\nTrading insults and threats\nThe feud started at a simmer last week, began bubbling on Wednesday and became a full-on boil on Thursday afternoon in the Oval Office. As new German Chancellor Friedrich Merz – the day's visitor – sat in awkward silence, the president sounded a bit like a spurned lover.\nHe expressed surprise at Musk's criticism of his legislation. He pushed back against the notion that he would have lost last year's presidential election without Musk's hundreds of millions of dollars in support. And he said Musk was only changing his tune now because his car company, Tesla, will be hurt by the Republican push to end electric vehicle tax credits.\nMusk quickly took to his social media site, X, with a very Generation X response for his 220 million followers: \"Whatever\". He said he didn't care about the car subsidies, he wanted to shrink the national debt, which he says is an existential threat to the nation. He insisted that Democrats would have prevailed in last year's election without his help. \"Such ingratitude,\" he told Trump.\nThe billionaire then launched a series of extraordinary attacks throughout the afternoon, and the feud was on in earnest.\nMusk and Trump had formed a powerful but unlikely alliance, culminating in the tech billionaire having a key position of budget-slashing authority in the Trump administration. Musk's Department of Government Efficiency, or Doge, became one of the biggest stories of Trump's first 100 days, as it shuttered entire agencies and dismissed thousands of government workers.\nIt wasn't long, however, before speculation began over when – and how - the two outsized personalities would ultimately fall out.\nFor a while, it seemed like those predictions were off the mark. Trump stood by Musk even as the latter's popularity dropped, as he feuded with administration officials and as he became a liability in several key elections earlier this year.\nEvery time it appeared there would be a break, Musk would pop up in the Oval Office, or the Cabinet room or on the president's Air Force One flight to Mar-a-Lago.\nWhen Musk's 130 days as a \"special government employee\" ended last week, the two had a chummy Oval Office send-off, with a golden key to the White House and hints that Musk might someday return.\nIt's safe to say that any invitation has been rescinded and the locks have been changed.\n\"Elon and I had a great relationship,\" Trump said on Thursday – a comment notable for its use of the past tense.\nThere had been some thought that Trump's surprise announcement on Wednesday night of a new travel ban, additional sanctions on Harvard and a conspiracy-laced administration investigation of former President Joe Biden were all efforts to change the subject from Musk's criticism. The White House and its allies in Congress seemed careful not to further antagonise him after his earlier comments.\nThen Trump spoke out and… so much for that.\n'A zero-sum game'\nNow the question is where the dispute goes next. Congressional Republicans could find it harder to keep their members behind Trump's bill with Musk providing rhetorical and, perhaps financial, air cover for those who break ranks.\nTrump has already threatened Musk's government contracts, but he could also take aim at Musk's remaining Doge allies in the administration or reopen Biden-era investigations into Musk's business dealings.\nEverything at this point is on the table.\nMeanwhile, Democrats are on the sidelines, wondering how to respond. Few seem willing to welcome Musk, a former donor to their party, back into the fold. But there's also the old adage that the enemy of an enemy is a friend.\n\"It's a zero-sum game,\" Liam Kerr, a Democratic strategist, told Politico. \"Anything that he does that moves more toward Democrats hurts Republicans.\"\nAt the very least, Democrats seem happy to stand back and let the two men exchange blows. And until they abandon this fight, the din is likely to drown out everything else in American politics.\nBut don't expect this spat to end anytime soon.\n\"Trump has 3.5 years left as president,\" Musk wrote on X, \"but I will be around for 40-plus years.\""
    },
    {
      "title": "Trump threatens to cut Musk contracts as feud quickly escalates",
      "link": "https://www.npr.org/2025/06/05/nx-s1-5424502/trump-elon-musk",
      "summary": "President Trump and his former adviser, Elon Musk, lashed out at each other on social media Thursday in a public feud that has ramped up since Musk left his role with the administration last week.",
      "source": "https://feeds.npr.org/1001/rss.xml",
      "category": "politics",
      "confidence": 0.7069894075393677,
      "story_cluster": 1,
      "full_text": "Trump threatens to cut Musk contracts as feud quickly escalates\nThe feud between President Trump and his former adviser Elon Musk ramped up Thursday as the two lashed out at each other on social media.\nMusk — who for days has been blasting a GOP megabill advancing most of Trump's biggest domestic policy priorities — said that Trump would have lost the election without his support, and called him ungrateful.\nThen Trump posted that \"the easiest way\" to save billions of dollars of government spending would be to \"terminate Elon's governmental subsidies and contracts.\" Musk is the CEO of companies that make electric cars and rockets.\nMusk, in turn, posted that Trump hadn't released all the records around sex offender Jeffrey Epstein because — according to Musk — Trump himself is implicated in those files. Musk did not provide any evidence of this, and Musk has in the past accused people of sex crimes without evidence. The White House had no immediate comment on Musk's post.\nThe public feud seemed to drive a stake through what had been a big-money political bromance. Musk, who spent close to $300 million to elect Trump and became one of his closest advisers before leaving the administration last week, suggested it was time to start a new political party.\nTrump was asked about Musk's criticism of the megabill at the White House\nThe sniping was sparked by comments Trump made in the Oval Office earlier in the day when asked about Musk's criticism of the tax and spending bill. Trump said he was surprised that Musk had been scorching the package, but said he thought Musk was wrong and conflicted in his criticism.\n\"Elon and I had a great relationship. I don't know if we will anymore,\" Trump told reporters in the Oval Office.\n\"He's worn that hat, 'Trump was right about everything' -- and I am right about the great big, beautiful, bill,\" Trump said.\nHe said Musk \"knew the inner workings of this bill better than almost anybody\" and \"never had a problem until right after he left.\" On X, Musk quickly countered, claiming \"this bill was never shown to me even once.\"\nMusk, who for months led the administration's government-slashing unit, has called the bill \"pork-filled\" and a \"disgusting abomination.\"\n\"In the entire history of civilization, there has never been legislation that both big and beautiful,\" Musk posted Thursday. \"Everyone knows this! Either you get a big and ugly bill or a slim and beautiful bill. Slim and beautiful is the way.\"\nTrump said he thought Musk was upset because the bill proposes to cut subsidies for electric vehicles, a policy that would affect his company Tesla, and because Trump pulled his nominee for NASA on Saturday. That pick, Jared Isaacman, had been recommended by Musk, and the nomination had cleared committee and was awaiting Senate confirmation. Isaacman is a friend of Musk, and his online payment company, Shift 4, has financial ties to SpaceX. On Thursday, Trump suggested he didn't think the relationship \"was appropriate.\"\nHe noted that Musk had only had positive things to say upon leaving the Oval Office last week. \"You saw a man who was very happy when he stood behind the Oval desk. And even with the black eye — I said, 'You want a little makeup? We'll get you there to make up,' but he said, 'No, I don't think so.' Which is interesting and very nice. He wants to be who he is,\" Trump said.\nTrump said he thought that Musk missed being part of the action at the White House, and said he was similar to other former staffers who leave to become critics.\n\"They leave, and they wake up in the morning, and the glamor is gone. The whole world is different, and they become hostile, I don't know what it is,\" Trump said.\nLater, on his Truth Social social media platform, Trump sharpened his attack on Musk: \"Elon was 'wearing thin,' I asked him to leave, I took away his EV mandate … and he just went CRAZY,\" Trump posted.\n— Danielle Kurtzleben contributed to this story."
    },
    {
      "title": "Trump Musk feud explodes with claim president is in Epstein files",
      "link": "https://abcnews.go.com/Politics/trump-disappointed-elon-musk-musk-strikes-back-real/story?id=122543215",
      "summary": "President Trump and Elon Musk's rift exploded into public view on Thursday over what started out as differences on the president's megabill.",
      "source": "https://abcnews.go.com/abcnews/topstories",
      "category": "politics",
      "confidence": 0.48572486639022827,
      "story_cluster": 1,
      "full_text": "Trump Musk feud explodes with claim president is in Epstein files\nTrump has not responded to Musk's attack regarding the alleged sex trafficker.\nA war of words between Elon Musk and President Donald Trump erupted into a full meltdown Thursday, with Musk slamming Trump for \"ingratitude\" over the 2024 election, agreeing with a call for his impeachment, knocking the president's signature legislation and even claiming Trump was in the Epstein files.\nTrump, speaking on television from the Oval Office, had said he was \"disappointed\" in Musk following his criticism Wednesday of his \"big, beautiful\" megabill to fund his agenda, and then engaged in a mutual barrage of social media posts, at one point saying Musk had gone \"CRAZY.\"\nAs the exchanges grew progressively personal, Musk posted, without providing evidence, about Trump and accused sex trafficker Jeffrey Epstein, \"Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!\"\nHe followed that up with another post, saying, \"Mark this post for the future. The truth will come out.\"\nTrump has previously posted, \"I was never on Epstein's Plane, or at his 'stupid' Island,\" and he has not publicly objected to the release of the files now under Justice Department review.\nTrump's previous association with Epstein and the appearance of his name in an address book and on flight logs of Epstein's planes has been widely reported.\nEpstein died by suicide in his prison cell in 2019.\nThe public rift between Musk and Trump began in earnest with Musk's rampage against the president's domestic megabill. Musk takes issue with the bill's price tag and its estimated impact on the national debt.\nSpeaking to reporters at the White House earlier on Thursday, Trump pushed back on Musk in extensive remarks.\n\"Look, Elon and I had a great relationship. I don't know if we will anymore,\" Trump said.\nMusk responded in real time to Trump's personal comments on X, swiping at the legislation and at Trump directly.\nAt one point, Musk responded to a user: \"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate.\"\n\"Such ingratitude,\" Musk added. Musk spent more than $270 million to back Trump and other Republicans during the 2024 election cycle.\nLater, he reposted a comment calling for Trump's impeachment to be replaced by Vice President JD Vance. \"Yes,\" Musk wrote in response to the idea.\nThe back-and-forth only escalated as the day went on.\nTrump countered on his own conservative social media platform: \"Elon was 'wearing thin,' I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!\"\nTrump said the \"easiest way to save money\" would be to \"terminate Elon's governmental subsidies and contracts.\"\nMusk went on to criticize not only Trump's bill but also his tariff policy -- a cornerstone of the president's economic agenda and a decades-long political goal. He claimed on X that the tariffs would cause a \"recession in the second half of this year.\"\nMusk and Trump had not spoken as of Thursday morning, according to two sources familiar with the president's conversations.\nMultiple administration officials have attempted to reach out to Musk and his representatives personally, but their calls and texts have not been returned, several sources tell ABC News.\nThe \"One Big Beautiful Bill Act\" passed the House last month by a single vote. The measure would extend Trump's 2017 tax cuts and boost spending for the military and border security, while making some cuts to Medicaid, SNAP and other assistance programs.\nIt now faces headwinds in the Senate, specifically among a small group of Republican fiscal hawks.\nMusk has said the the legislation, estimated by the nonpartisan budget office to add $3 trillion to the deficit over the next decade, would undermine the Department of Government Efficiency's goal to reduce government spending and chip away at the nation's debt.\n\"Where is this guy today??\" Musk wrote as he reupped another user's compilation of past Trump tweets criticizing high deficits, unbalanced budgets and more.\nMusk made similar comments on X toward Senate Majority Leader John Thune and House Speaker Mike Johnson.\nTrump contended on Thursday that Musk, the CEO of Tesla, was really \"upset\" because the legislation would remove tax credits for electric vehicles.\nBefore speaking out publicly against the bill, Musk personally pushed some lawmakers, including Speaker Johnson, to keep the tax credits for electric vehicles in the bill, according to two people familiar with conversations.\n\"I'm very disappointed because Elon knew the inner workings of this bill better than almost anybody sitting here, better than you people,\" Trump said in the Oval Office on Thursday. \"He knew everything about it. He had no problem with it. All of a sudden, he had a problem.\"\nMusk pushed back on X and suggested Trump was not telling the truth.\n\"False, this bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\" he wrote.\nIn another post, Musk wrote: \"Whatever.\"\n\"In the entire history of civilization, there has never been legislation that both big and beautiful,\" Musk added. \"Everyone knows this! Either you get a big and ugly bill or a slim and beautiful bill. Slim and beautiful is the way.\"\nAs of now, the Tesla that President Trump bought to show support for Elon Musk is still on the White House complex, according to two sources.\nThe White House declined to comment. A representative for Musk has not yet returned request for comment."
    },
    {
      "title": "Trump and Musk trade barbs as public feud over budget bill turns personal",
      "link": "https://www.cbsnews.com/video/trump-and-musk-trade-barbs-as-public-feud-over-budget-bill-turns-personal/",
      "summary": "The relationship between President Trump and Elon Musk broke down in dramatic and public fashion, with the president threatening to cancel Musk's lucrative government contracts and Musk claiming that Mr. Trump could not have won the presidency without him, fueling a feud that erupted over Musk's opposition to Republicans' tax and budget bill. Nancy Cordes has details.",
      "source": "https://www.cbsnews.com/latest/rss/main",
      "category": "politics",
      "confidence": 0.6489231586456299,
      "story_cluster": 1,
      "full_text": "Trump and Musk trade barbs as public feud over budget bill turns personal\nThe relationship between President Trump and Elon Musk broke down in dramatic and public fashion, with the president threatening to cancel Musk's lucrative government contracts and Musk claiming that Mr. Trump could not have won the presidency without him, fueling a feud that erupted over Musk's opposition to Republicans' tax and budget bill. Nancy Cordes has details."
    },
    {
      "title": "Trump and Musk have a very public break up",
      "link": "https://www.npr.org/2025/06/05/nx-s1-5424457/trump-and-musk-have-a-very-public-break-up",
      "summary": "The feud seemed to drive a stake through the big-money political bromance between the president and Elon Musk -- who spent close to $300 million to elect Trump and became one of his closest advisers.",
      "source": "https://feeds.npr.org/1014/rss.xml",
      "category": "politics",
      "confidence": 0.7106867432594299,
      "story_cluster": 1,
      "full_text": "Trump and Musk have a very public break up\nThe feud seemed to drive a stake through the big-money political bromance between the president and Elon Musk — who spent close to $300 million to elect Trump and became one of his closest advisers.\nMARY LOUISE KELLY, HOST:\nIt was only a week ago that President Trump and Elon Musk were side by side in the Oval Office saying fond farewells as the billionaire adviser returned to the private sector. Then today, again in the Oval, Trump delivered withering criticism for the donor he once relied on to find trims to government spending. Then Musk fired back on social media, and here we are. NPR White House correspondent Danielle Kurtzleben is here to talk us through it. Hey there.\nDANIELLE KURTZLEBEN, BYLINE: Hey there.\nKELLY: OK, so a very public breakup. What is going on?\nKURTZLEBEN: Well, the genesis of this breakup is the Big Beautiful Bill, as Republicans are calling their massive policy package that they're trying to pass right now. Now, Musk has been slamming that bill all week long. At one point, he called it a disgusting abomination, pointing to its cost. The nonpartisan CBO, I should add, has reported that the bill would add $2.4 trillion to the deficit over 10 years. And importantly, there are some on Capitol Hill who agree with Musk. They are balking at that price tag. Well, today, Trump was asked about Musk's criticism, and Trump said he thinks Musk is angry that the bill would end tax incentives for people buying electric cars. Musk, after all, is the CEO of electric carmaker Tesla.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRESIDENT DONALD TRUMP: All of a sudden he had a problem, and he only developed the problem when he found out that we're going to have to cut the EV mandate because that's billions and billions of dollars.\nKURTZLEBEN: Now, that's not all. Trump also added that he thinks Musk just misses the power and the attention that he had in government.\nKELLY: And how did Elon Musk respond to all that?\nKURTZLEBEN: Not well. Musk was responding in real time on social media. He was posting shortly after Trump's remarks. Musk said that, no, he didn't oppose the bill because of the EV tax credits. It was the cost. But things just escalated. Trump posted a threat to end the various government contracts Musk's companies have. Trump added that that would save billions of dollars. Well, Musk in turn, posted that Trump hadn't released all the records around sex offender Jeffrey Epstein because, according to Musk, Trump himself is implicated in those files. Now, Musk did not provide any evidence of this, and Musk has, in the past, accused people of sex crimes without evidence. By the way, I asked - the White House has no immediate comment on this. But look, these two guys love to post, and we...\nKELLY: Yeah.\nKURTZLEBEN: ...Can probably expect this to keep going.\nKELLY: Yes, that is a sure bet. OK, so we have this, as we said, very public breakup in the bromance between the president and his billionaire adviser. Beyond, you know, taking up a lot of bandwidth on social media, does it matter, Danielle?\nKURTZLEBEN: Well, look, on one level, it's easy to gawk at - right? - two angry, powerful guys sniping at each other. But there's a few important points I would add here. One is that there have been business consequences. Shares of Tesla plummeted this afternoon. Another point is that there are very tight margins to pass that Big Beautiful Bill on Capitol Hill, so if Musk has some pull with even a few Republicans, that could very much hurt that bill's chances of passing.\nBut there's one more really important point here. Amid all of this today, Musk posted, quote, \"without me, Trump would have lost the election.\" Now, that's a reminder. He's saying that he dumped more than a quarter of a billion dollars into the 2024 election. So he's sending a message that he, Elon Musk, has money, which means he has power.\nKELLY: Danielle, just about 45 seconds left here, but can I, while I've got you, ask about one other thing making headlines today, which is tariffs? What do we need to know?\nKURTZLEBEN: Well, Trump spoke to Chinese president Xi Jinping on the phone today. He said they talked for around an hour and a half and that they're still trying to hash out that longer-term trade deal to lower tariffs between the two countries. A meeting is coming up between the two countries, but Trump did not say when or where that's going to happen.\nKELLY: NPR's Danielle Kurtzleben, thanks so much.\nKURTZLEBEN: Thank you.\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record."
    },
    {
      "title": "Trump and Musk trade barbs in public falling out",
      "link": "https://www.dw.com/en/trump-and-musk-trade-barbs-in-public-falling-out/a-72809215?maca=en-rss-en-all-1573-rdf",
      "summary": "Donald Trump and Elon Musk's disagreement over a budget bill has exploded into an open feud as Musk links US president to Epstein files.",
      "source": "https://rss.dw.com/rdf/rss-en-all",
      "category": "politics",
      "confidence": 0.7510330080986023,
      "story_cluster": 1,
      "full_text": "Trump and Musk trade barbs in public falling out\nJune 6, 2025US President Donald Trump and his former adviser, Elon Musk are having a very public falling out.\nAs Trump hosted German Chancellor Friedrich Merz in the White House, the US president expressed his \"disappointment\" with Musk over his public criticism of Trump's tax and spending bill that is up for approval by the Senate.\nTrump-Musk relationship unravels\nTrump said he didn't know if his \"great relationship\" with Musk would remain the same after the billionaire slammed the bill on social media as \"a disgusting abomination.\"\n\"Look, Elon and I had a great relationship. I don't know if we will anymore. I was surprised,\" Trump told reporters in the Oval Office.\nTrump claimed Musk's opposition to the bill was driven by its elimination of tax credits for electric vehicles, which would potentially hurt Tesla.\nThe US president later posted on his media platform Truth Social that Musk \"just went CRAZY\" after \"I took away his EV Mandate.\"\nMusk, however, says he opposes the bill because it would increase federal deficits, posting on X on Wednesday that \"Congress was spending America into bankruptcy.\"\nIt was part of a barrage of sniping posts that Musk launched on Wednesday evening.\nHis posts then moved from politics to the personal, with Musk linking Trump and convicted sex offender Jeffrey Epstein.\nMusk claims Trump in Epstein files\n\"Time to drop the really big bomb: @realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!\" Musk posted late Wednesday evening.\nMusk provided no evidence for his claims.\nTrump's previous association with the wealthy financier Jeffrey Epstein, who hanged himself while awaiting trial, has been widely reported in the past.\nTrump has said the two had a falling-out 15 or so years ago and hasn't publicly objected to the release of the Epstein files. These are the documents linked to the sex-trafficking investigation into Epstein.\nThe files are currently under review by the Justice Department.\nTrump threatens to cut Musk's government contracts\nTrump hasn't responded to Musk's posts about Epstein.\nBut late on Wednesday evening, he threatened to cut Musk's government contracts in a Truth Social post.\n\"The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon's Governmental Subsidies and Contracts. I was always surprised that Biden didn't do it!\" Trump said.\nElon was \"wearing thin,\" Trump posted.\nMusk spent at least $250 million (€218 million) backing Trump's bid to return to the White House and was tasked with heading up the cost-cutting Department of Government Efficiency (DOGE).\nJust under a week ago, Trump gave Musk a sendoff in the Oval Office in which Musk appeared with a visible black eye which he said came from his young son.\nThis article was updated on June 6, 2025 to include more recent posts.\nEdited by: Wesley Rahn and Saim Dušan Inayatullah"
    },
    {
      "title": "Why are Elon Musk and Donald Trump fighting?",
      "link": "https://techcrunch.com/2025/06/05/why-are-elon-musk-and-donald-trump-fighting/",
      "summary": "Elon Musk donated $288 million to Trump's 2024 election campaign, but now the tech mogul is calling for Trump's impeachment.",
      "source": "https://techcrunch.com/feed/",
      "category": "politics",
      "confidence": 0.6033783555030823,
      "story_cluster": 1,
      "full_text": "President Donald Trump and his biggest political supporter Elon Musk are breaking up in the most public and 21st century way — via their own social networks. And while many predicted the Trump-Musk pair-up would eventually sour, it’s still worth asking and trying to answer, “How did we get here?”\nUntil recently, Musk has been a key figure in Trump’s inner circle. The connection has affected broad swaths of the government, notably through the Department of Government Efficiency, an organization created by an executive order and advised by Musk.\nMusk, once a fixture at Trump’s Mar-a-Lago resort in Palm Beach, Florida, and in the White House, has now turned against the president. The source of his discontent: the One Big Beautiful Bill Act, a 1,038-page piece of legislation that was passed May 22 by the House of Representatives. It now heads to the Senate, the next step in the bill’s path toward becoming a law.\nDays later, Trump withdrew his nomination of Jared Isaacman, Musk’s pick to head NASA — a move widely viewed as evidence of their faltering relationship. But even through the end of the month, Trump and Musk publicly played nice.\nThe mood shifted — in a public, scorched-earth kind of way — this week.\n“I’m sorry, but I just can’t stand it anymore,” Musk wrote on X on Tuesday. “This massive, outrageous, pork-filled Congressional spending bill is a disgusting abomination. Shame on those who voted for it: you know you did wrong. You know it.”\nThe bill is presented as an effort to cut taxes and invest in American businesses. However, the Congressional Budget Office (CBO) estimates that while the bill will cut taxes by $3.7 trillion, it will increase the national debt by $2.4 trillion over 10 years and raise the country’s debt ceiling by $4 trillion. This impact on the country’s existing debt crisis has two Republican senators, Rand Paul (R-KY) and Ron Johnson (R-WI), breaking from their party’s stance to oppose the bill in its current state.\nThe bill’s impacts are vast; among numerous other effects, it removes taxes from Social Security income, tips, and overtime pay. The bill also makes massive cuts to federal healthcare programs like Medicaid and SNAP. The CBO estimates that, by making massive cuts to federal healthcare programs, almost 11 million more people will lack health insurance by 2034.\nSave $200+ on your TechCrunch All Stage pass\nBuild smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections.\nExhibit at TechCrunch Sessions: AI\nSecure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last.\nThe bill would also make the effects of Trump’s Tax Cuts and Jobs Act from his first term permanent, though economists have found that these cuts had more benefit for the richest Americans than the poorest. Additional tax cuts in Trump’s new bill are also expected to benefit wealthy families more than those in need.\nMusk isn’t wrong when he says some representatives who voted for the bill are already regretting it. Marjorie Taylor Greene (R-GA) admitted that she had not read the thousand-page bill in its entirety and regrets endorsing it because it would prevent individual states regulating AI for the next decade.\nThe dispute between Trump and Musk escalated further Thursday, when the president was asked about the Tesla and SpaceX leader’s rejection of the bill.\nTrump claims that Musk was deeply familiar with his plans for the bill but recoiled when he learned it would negatively impact his business.\n“He only developed a problem when he found out that we’re going to have to cut the EV mandate,” Trump said, referring to policies that incentivize the production and sale of electric vehicles, like the ones Tesla makes. “That’s billions and billions of dollars.”\nMusk went on to claim that Trump only won the election because of his help.\n“Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate,” Musk said on X.\nThe two entrepreneurs have continued to make jabs at each other on their respective social media platforms — and it’s escalating.\n“Elon was ‘wearing thin,’ I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!” Trump wrote on Truth Social.\nIn another post, Trump added, “The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon’s Governmental Subsidies and Contracts. I was always surprised that Biden didn’t do it!”\nMusk posted a screenshot of Trump’s post and added that he would decommission SpaceX’s Dragon spacecraft as a result of the president’s statement.\nMusk has continued on with a barrage of posts on X against the president, who he spent $288 million to help elect. Musk then accused Trump of being in the Epstein Files, referring to the financier Jeffrey Epstein’s sexual exploitation of children. Trump has not responded to the allegation.\nMusk also declared that the Trump tariffs will cause a recession in the latter half of this year, and he posted an agreement with another user’s post saying that Trump should be impeached.\nWhile the public fight has launched frantic levels of posting on X, popcorn emojis, and memes declaring that “the girls are fighting,” the fallout between the world’s richest person and a sitting U.S. president promises to have broader implications for the tech industry.\nFollowing Trump’s lead, other tech billionaires like Meta founder Mark Zuckerberg, Google CEO Sundar Pichai, Amazon founder Jeff Bezos, OpenAI CEO Sam Altman, and Apple CEO Tim Cook donated to Trump’s inauguration fund. Trump’s policies have already had negative repercussions for some of these companies’ businesses through enforcing heavy tariffs on international imports."
    }
  ],
  "tech": [
    {
      "title": "Walmart and Wing expand drone delivery to five more US cities",
      "link": "https://techcrunch.com/2025/06/05/walmart-and-wing-expand-drone-delivery-to-five-more-u-s-cities/",
      "summary": "Walmart and Wing are expanding their partnership and rolling out drone delivery to dozens of more stores in Atlanta, Charlotte, Houston, Orlando, and Tampa.",
      "source": "https://techcrunch.com/feed/",
      "category": "tech",
      "confidence": 0.613154411315918,
      "story_cluster": 3,
      "full_text": "Wing, the on-demand drone delivery company owned by Alphabet, is spreading its commercial wings with help from Walmart.\nThe two companies announced Thursday plans to roll out drone delivery to more than 100 Walmart stores in five new cities: Atlanta, Charlotte, Houston, Orlando, and Tampa. Walmart is also adding Wing drone deliveries to its existing market in the Dallas-Fort Worth area.\nThe expansion signals Walmart’s growing confidence in drone delivery. Greg Cathey, who is senior vice president of Walmart’s U.S. Transformation and Innovation department, said drone delivery would remain a key part of its “commitment to redefining retail.”\n“We’re pushing the boundaries of convenience to better serve our customers, making shopping faster and easier than ever before,” Cathey said in a blog posted Thursday.\nThe expansion also marks a turning point for Wing, from Alphabet X graduate to commercial enterprise. Wing partnered with Walmart in 2023 and launched a pilot program to test on-demand drone delivery at two stores in the Dallas metro area that reached about 60,000 homes. It has since grown to 18 Walmart Supercenters in Dallas-Fort Worth.\nThe expansion announced Thursday is nearly a five-fold increase of Wing’s operations with Walmart.\n“We’re decidedly out of the pilot and trial phase and into scaling up this business,” Wing CEO Adam Woodworth told TechCrunch in a recent interview. “We’ve always been the type of company that wants to do something well and stay focused. And so this is the next big bite at the apple. It’s a much bigger bite than we’ve taken before.”\nSave $200+ on your TechCrunch All Stage pass\nBuild smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections.\nExhibit at TechCrunch Sessions: AI\nSecure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last.\nWoodworth said the pilot program in Dallas-Fort Worth, and specifically how it scaled, helped form Wing’s drone delivery strategy in the retail sector.\n“We figured out how the expansion worked out and looked in DFW, and now we’re sort of copy-pasting that across more markets,” he added.\nWoodworth wouldn’t say whether Wing was profitable yet or when it would be. But he did say the company is focused on how to scale its deliveries while keeping its expenses in check. Wing’s hypothesis is to build a business centered on small, lightweight, automated, low-cost airplanes — aka drones. There are fixed operational costs tied to those physical assets such as flight operations and training. The crux, and what Wing is trying to navigate, is how to scale the number of drones and flights without adding even more personnel.\n“The more places you can be operating, the more you can be flying, the more you can defray those costs. This is a meaningful step in that direction,” he said, adding that Wing is trying to keep its resources flat as the scale continues to go up.\nWing is also pushing into the restaurant food delivery sector through its partnership with DoorDash. The two companies paired up in 2022 to launch drone deliveries in Australia and have since worked together in Dallas-Forth Worth and more recently in Charlotte."
    },
    {
      "title": "Wing and Walmart are bringing drone delivery to 100 new stores",
      "link": "https://www.theverge.com/news/680723/walmart-wing-drone-delivery-expand-cities-100-stores",
      "summary": "Wing, the drone company owned by Alphabet, and Walmart are expanding their delivery partnership to five new cities in the US, the companies announced today. Customers who shop at Walmart stores in Atlanta, Charlotte, Houston, Orlando, and Tampa will soon have the ability to request a drone deliver their online shopping orders. Walmart and Wing [&#8230;]",
      "source": "https://www.theverge.com/rss/index.xml",
      "category": "tech",
      "confidence": 0.6134782433509827,
      "story_cluster": 3,
      "full_text": "Wing, the drone company owned by Alphabet, and Walmart are expanding their delivery partnership to five new cities in the US, the companies announced today. Customers who shop at Walmart stores in Atlanta, Charlotte, Houston, Orlando, and Tampa will soon have the ability to request a drone deliver their online shopping orders.\nWing and Walmart are bringing drone delivery to 100 new stores\nCustomers who shop at Walmart stores in Atlanta, Charlotte, Houston, Orlando, and Tampa will soon have the ability to request a drone deliver their online shopping orders.\nWalmart and Wing currently offer drone delivery at approximately 15 stores in northwest Arkansas and Dallas-Fort Worth. Today’s announcement will bring an additional 100 stores into the fold.\n“As we look ahead, drone delivery will remain a key part of our commitment to redefining retail,” said Greg Cathey, SVP, Walmart U.S. Transformation and Innovation, in a statement. “We’re pushing the boundaries of convenience to better serve our customers, making shopping faster and easier than ever before.”\nWalmart has been working with a number of drone operators, but it seems to be most happy with its partnership with Wing. Since launching drone delivery in 2021, Walmart says it has completed more than 150,000 deliveries — sometimes within 30 minutes of the order being placed.\nThere are a few restrictions: Customers must live within six miles of a store under FAA rules governing drone operations “beyond the visual line of sight.” An order needs to be under a certain weight to qualify for drone delivery, but Walmart says that covers everything from groceries to health and wellness products to household goods.\nSince launching drone delivery in 2021, Walmart says it has completed more than 150,000 deliveries\nWing’s flagship drone is designed to handle payloads of up to 2.5 pounds, while its newer models can handle up to five pounds. The company says that it has enough battery power to complete 12 miles round trip while cruising at a top speed of 65 mph. The drones use tethers and grappling hooks to pick up and drop off small bags and cardboard boxes on customers’ front lawns. Wing says it has completed over 450,000 residential deliveries since its inception in 2012. Wing also conducts drone deliveries for DoorDash in Dallas and Charlotte, North Carolina.\nWing is also thinking about other ways to improve the efficiency of its delivery network. It created a system that enables its drones to dynamically take pickup and delivery jobs back to back without needing to report back to an originating base. This system includes the use of Autoloader stations, which are installed at retailers’ parking lots for employees to load a prepared order when ready. When a drone is available, it can lower a rope to grab it without anyone waiting around.\nDrone delivery companies claim that by shifting more deliveries to small electric multi-rotor aircraft, fewer polluting trucks will be needed for last-mile deliveries. It’s a similar pitch being made by sidewalk robot companies delivering takeout orders to residents of Los Angeles and other cities."
    },
    {
      "title": "Walmart Goes Big With Drone Delivery Expansion",
      "link": "https://www.wired.com/story/walmart-wing-expand-drone-delivery/",
      "summary": "Walmart, with its partner Wing, plans to bring drone delivery to 100 new stores in five new US cities: Atlanta, Charlotte, Houston, Orlando, and Tampa.",
      "source": "https://www.wired.com/feed/rss",
      "category": "tech",
      "confidence": 0.5561990737915039,
      "story_cluster": 3,
      "full_text": "For nearly two years, Alphabet’s drone company, Wing, has managed deliveries for a handful of Walmart locations in the Dallas-Fort Worth area. Customers in the metro region can click “checkout” on a small order on Walmart’s website or app and, within an average delivery window of 19 minutes, see a drone buzz above their lawn or backyard and lower a delivery box on a tether.\nNow both companies say the service is ready for serious expansion. They announced Thursday that Wing’s drone delivery service will roll out to 100 additional US stores in the next year, including Walmart locations in Atlanta, Charlotte, Houston, Orlando, and Tampa. The companies say the expansion will give “millions” of homes access to drone delivery within 30 minutes or less, making the drone delivery network the largest in the country.\nThe expansion will test shoppers’ enthusiasm for super-quick deliveries—and communities’ interest in sharing airspace with a new kind of delivery vehicle. It will also likely help both companies analyze the commercial viability of drone delivery services, which have rolled out to a handful of areas across the world—including northwest Arkansas, metro Raleigh, North Carolina, and Lockeford, California, plus parts of Australia, Finland, Ireland, and Rwanda—but have yet to transform how global consumers think about quick delivery.\nSome critics who have studied the drone industry doubt routine deliveries can become truly profitable. “It’s unlikely that it will become commercially viable in the foreseeable future,” says Matthias Winkenbach, who directs research at the MIT Center for Transportation & Logistics and has written about the industry. He cites regulatory hoops, the high costs of employing drone pilots, and the challenges of working in unpredictable situations with unpredictable people—namely, customers’ homes and customers themselves. Plus, he says, it’s hard to beat the efficiency and price of a “good old UPS truck.”\nWing says it will use what it’s learned about drone delivery rollouts in Dallas to quickly bring its services to other cities starting in the coming months. In that region, 18 stores are equipped with 18 drones each. Together, they deliver about 1,000 orders per day, says Adam Woodworth, the CEO of Wing. Top deliveries include baby wipes and eggs, he says, plus the items a person might not normally get delivered but want right now: a pint of milk because the kid wants a glass, or a forgotten recipe ingredient. At most stores, Wing workers pick, pack, and deploy drone orders; the plane-like drones, which have a five-foot wingspan, can carry packages weighing up to 5 pounds.\nParts of Dallas have access to drone deliveries of a broad selection of items for a fee of $20 per shipment, which is discounted to free for members of the $98-a-year Walmart+ program. A limited selection of items—generally priced no differently than in Walmart’s stores—are available to all customers for free delivery from Wing’s app. In initial expansion locations, only the latter option of ordering through Wing’s app will be available.\nWalmart’s US drone deployments, which include a more recent Dallas-area partnership with drone logistics and delivery company Zipline and now-shuttered work with the company DroneUp, have been met with little protest or fanfare. But a similar drone deployment by Amazon’s Prime Air in College Station, Texas, riled up neighbors, WIRED has reported, who complained about noise, worried about surveillance, and fretted over the drones’ possible effects on local wildlife. Amazon temporarily suspended deliveries in Texas and another site in Arizona after two drones fell from the sky during December test flights. And last month, a drone landed askew in someone’s front yard. No one was hurt in the incidents, and Amazon is still operating drone delivery in Texas and Arizona, with launches in San Antonio and Richardson, Texas, and Kansas City, Missouri forthcoming.\nWing’s drones are lighter than those used by Amazon, and Woodworth says Walmart stores’ neighbors will be hard pressed to even spot them in the sky. He says the company has seen a “handful” of precautionary landings in “preferred” safe spots like trees during its service in Dallas, but says they have “largely been non-events.” The company’s drones are “inherently safe,” he says. “We've seen that the architectural decisions that we've made early on have paid off in the operational reliability.”\nIt’s no accident, though, that the drone service expansion is across relatively warm and temperate metros. Drones do not perform dependably in extreme weather, and if their batteries get very cold, they need to be warmed back up again. Service is faster and more reliable in places with better weather, says Woodward.\nDrones are regulated in the US by the Federal Aviation Administration, but Woodworth says Wing has worked with municipalities in the expansion areas to clarify where and how the company can build its drone infrastructure, which he calls “lightweight.” In April, the FAA authorized Wing to deliver from 7 am to 10 pm up to 30,000 times daily in the Dallas area and as many as 10,000 in the Charlotte region.\nHow does this all pencil out? Woodworth declined to comment on Wing’s business model, and says that the financial arrangements differ across delivery partners. (Wing is also working with DoorDash in Australia, and medical logistics firm Apian and the UK National Health Service to transport blood between hospitals in London.) Generally, though, he says Wing sees a future where it takes a delivery fee cut from each transaction.\nIn an emailed statement, Walmart innovation executive Greg Cathey called drone delivery a “key part of our commitment to redefining retail.”"
    },
    {
      "title": "Walmart expands its partnership with Alphabet-owned Wing to bring drone delivery services to Atlanta, Charlotte, Houston, Orlando, and Tampa, adding 100 stores (Andrew J. Hawkins/The Verge)",
      "link": "http://www.techmeme.com/250605/p41#a250605p41",
      "summary": "<a href=\"https://www.theverge.com/news/680723/walmart-wing-drone-delivery-expand-cities-100-stores\"><img align=\"RIGHT\" border=\"0\" hspace=\"4\" src=\"http://www.techmeme.com/250605/i41.jpg\" vspace=\"4\" /></a>\n<p><a href=\"http://www.techmeme.com/250605/p41#a250605p41\" title=\"Techmeme permalink\"><img height=\"12\" src=\"http://www.techmeme.com/img/pml.png\" style=\"border: none; padding: 0; margin: 0;\" width=\"11\" /></a> Andrew J. Hawkins / <a href=\"https://www.theverge.com/\">The Verge</a>:<br />\n<span style=\"font-size: 1.3em;\"><b><a href=\"https://www.theverge.com/news/680723/walmart-wing-drone-delivery-expand-cities-100-stores\">Walmart expands its partnership with Alphabet-owned Wing to bring drone delivery services to Atlanta, Charlotte, Houston, Orlando, and Tampa, adding 100 stores</a></b></span>&nbsp; &mdash;&nbsp; Customers who shop at Walmart stores in Atlanta, Charlotte, Houston, Orlando, and Tampa will soon have the ability to request a drone deliver their online shopping orders.</p>",
      "source": "https://www.techmeme.com/feed.xml",
      "category": "tech",
      "confidence": 0.620083212852478,
      "story_cluster": 3,
      "full_text": "| Kevin Breuninger / CNBC: |\n| David Keohane / Financial Times: |\n| Tanaya Macheel / CNBC: |\n| Abner Li / 9to5Google: |\n| Olga Kharif / Bloomberg: |\n| Lila Shapiro / Vulture: |\n| Emine Saner / The Guardian: |\n| Thomas Brewster / Forbes: |\n| Bloomberg: |\n| Kyle Wiggers / TechCrunch: |\n| Shannon Bond / NPR: |\n| Katherine Hamilton / Wall Street Journal: |\n| Sarah Perez / TechCrunch: |\n| Joseph Cox / 404 Media: |\n| Sergiu Gatlan / BleepingComputer: |\n| Maxwell Zeff / TechCrunch: |\n| Dario Amodei / New York Times: |\n| Tom Warren / The Verge: |\n| Sara Fischer / Axios: |\n| Ivan Mehta / TechCrunch: |\n| Andrew J. Hawkins / The Verge: |\n| Edward Ludlow / Bloomberg: |\n| Dylan Martin / CRN: |\n| Arjun Kharpal / CNBC: |\n| Rocket Drew / The Information: |\nThis is a Techmeme archive page. It shows how the site appeared at 8:10 PM ET, June 5, 2025.\nThe most current version of the site as always is available at our home page. To view an earlier snapshot click here and then modify the date indicated.\n| Chris Welch / Bloomberg: |\n| Munsif Vengattil / Reuters: |\n| Bloomberg: |\n| Kyt Dotson / SiliconANGLE: |\n| Matthew Gault / Wired: |\n| Riley Griffin / Bloomberg: |"
    }
  ],
  "world": [
    {
      "title": "From bromance to breakup: How Elon Musk and Donald Trump blew up",
      "link": "https://www.npr.org/2025/06/05/nx-s1-5424686/donald-trump-elon-musk-bromance-breakup",
      "summary": "The blow up marks the end of an alliance between the president and the billionaire that lasted far longer than many observers expected.",
      "source": "https://feeds.npr.org/1001/rss.xml",
      "category": "world",
      "confidence": 0.3842831254005432,
      "story_cluster": 0,
      "full_text": "From bromance to breakup: How Elon Musk and Donald Trump blew up\nElon Musk and President Donald Trump's very public bromance is going through a very public breakup.\nOn Thursday, their disagreements over the Republican mega-bill advancing most of Trump's biggest domestic policy priorities erupted into personal attacks, with the two men using their respective social media platforms to hurl insults.\nAfter Trump threatened on Truth Social to cut off billions of dollars in federal subsidies and contracts to Musk's companies, which include Tesla and SpaceX, Musk claimed — without evidence — that Trump appears in government documents about convicted sex trafficker Jeffrey Epstein. \"That is the real reason they have not been made public,\" Musk claimed.\nThe White House declined to comment on Musk's accusation.\nThe blow up marks the end of an alliance between the president and the billionaire that lasted far longer than many observers expected.\nAfter donating to Democrats for years, Musk emerged in 2024 as the biggest Republican political donor, pouring nearly $300 million into backing Trump. He quickly became one of the most visible members of the president's inner circle, appearing with Trump in the Oval Office, at Cabinet meetings, and leading the Department of Government Efficiency.\nIn February, Musk posted on X: \"I love @realDonaldTrump as much as a straight man can love another man.\"\nHere's a quick history of the Trump-Musk relationship:\nPre-2024\nMusk has said he voted for Democrats, including Hillary Clinton in 2016 and Joe Biden in 2020. He was critical of Trump in his first term and resigned from two advisory councils after the Trump administration pulled out of the Paris climate accord.\nIn 2022, Trump called Musk a \"b******* artist\" and claimed the billionaire had told him he voted for him. Musk hit back that Trump was too told to run for office. \"I don't hate the man, but it's time for Trump to hang up his hat & sail into the sunset,\" he wrote.\nJuly 2024\nMusk endorsed Trump after the assassination attempt in Butler, Penn. \"I fully endorse President Trump and hope for his rapid recovery,\" Musk wrote on X minutes after the shooting.\nLater in the month, Musk revealed he had created and was funding a super PAC \"to promote the principles that made America great in the first place.\" He had previously said he wouldn't donate to either presidential candidate. He would go on to donate around $277 million in the election cycle.\nAugust 2024\nMusk hosted an interview with Trump on X. After lengthy technical delays, the conversation largely followed the contours of Trump's campaign speeches, and the two men both praised and talked past one another.\nMusk also took the opportunity to pitch Trump on a \"government efficiency commission,\" which the billionaire said he would join.\nOctober 2024\nMusk hit the campaign trail with Trump. Wearing a custom black \"Make America Great Again\" hat, the billionaire addressed a rally in Butler, Penn., where he hopped around on stage, described himself as \"dark MAGA,\" and predicted \"this will be the last election\" if Trump were not to win.\nMusk also took the stage at another Trump rally at Madison Square Garden in New York, and held a series of $1 million giveaways to voters in swing states.\nNovember 2024\nMusk spent election night at Trump's Mar-a-Lago in Florida. The morning after, he celebrated by posting an apparently AI-generated image of himself saluting the American flag, captioned, \"It is morning in America again.\"\nTrump thanked Musk in his victory speech, declaring: \"A star is born — Elon!\"\nLate 2024\nTrump announced Musk and former Republican presidential primary candidate Vivek Ramaswamy would co-lead a \"Department of Government Efficiency\" focused on curbing federal spending. At the time it was not clear whether the entity would exist inside or outside the government.\nMusk and Ramaswamy took their pitch to Capitol Hill, proposing a 75% reduction in the federal workforce, a $2 trillion cut to federal spending and the elimination of entire agencies such as the Consumer Financial Protection Bureau. Ramaswamy left the project before Trump took office.\nJanuary 2025\nMusk was one of several tech billionaires who attended Trump's inauguration. At another event that day, he sparked outrage when he performed a salute most prominently affiliated with Nazis.\nAfter the inauguration, Musk joined the White House as an unpaid presidential advisor. His \"special government employee\" status meant he had a 130-working day clock. He quickly became the most visible face of the Department of Government Efficiency, or DOGE — which, despite its name, is not an official congressionally-created federal department. Musk was the de facto leader of DOGE, even though the Trump administration repeatedly tried to argue in court that he was not.\nFebruary 2025\nTrump and Musk appeared together in the Oval Office, accompanied by Musk's young son, to defend the work of DOGE, which has cut a swath through federal agencies.\n\"The people voted for major government reform, and that's what people are going to get,\" Musk told reporters. \"They're going to get what they voted for.\"\nThey also addressed concerns that Musk's many companies, which have business with and are regulated by some of the agencies DOGE has targeted, created conflicts of interest.\nTrump said he would bar Musk from any government work he believed might create a conflict. \"If we thought that, we would not let him do that segment or look in that area, if we thought there was a lack of transparency or a conflict of interest,\" Trump said.\nLater in the month, Musk joined Trump's first Cabinet meeting. Trump introduced Musk by saying the billionaire was \"sacrificing a lot\" through his government work.\nAsked by a journalist about reports that some agency heads were unhappy with Musk's slash-and-burn approach, Trump asked, \"Is anybody unhappy?\" His question was met with laughter.\nA week later, Trump took the rare step of publicly reining in Musk. On March 6 he told Cabinet members that they are in charge of job cuts at their agencies, not Musk.\nMarch 2025\nTrump and Musk took the unprecedented step of turning the White House lawn into a temporary Tesla showroom. Trump sat inside a red Model S with Musk and announced his intention to buy a Tesla, in a show of support amid a global backlash against Tesla over Musk's controversial involvement in politics in both the U.S. and Europe, where he has thrown his support behind far-right parties.\nMay 2025\nMusk announced he was leaving the government, citing the end of his \"scheduled time\" as a special government employee. At a final Oval Office press conference, Trump praised Musk as \"one of the greatest business leaders and innovators the world has ever produced.\"\nDays later, Musk began railing against the so-called \"Big Beautiful Bill,\" saying it would drive up the federal budget deficit and undo the cost-cutting work of DOGE.\nJune 5, 2025\nSniping escalated into all-out war between the billionaire and the president.\nTrump posted on his Truth Social site: \"Elon was 'wearing thin,' I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!\"\nMusk shot back in a torrent of posts on X. \"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate,\" Musk wrote.\nHe also reposted a call for Trump to be impeached, writing, simply, \"Yes.\""
    },
    {
      "title": "Elon Musk and Donald Trump are smack-talking each other into their own digital echo chambers",
      "link": "https://techcrunch.com/2025/06/05/elon-musk-and-donald-trump-are-smack-talking-each-other-into-their-own-digital-echo-chambers/",
      "summary": "Elon Musk and Donald Trump are smack-talking each other into their own echo chambers.",
      "source": "https://techcrunch.com/feed/",
      "category": "world",
      "confidence": 0.36892449855804443,
      "story_cluster": 0,
      "full_text": "Well, it finally happened. This town wasn’t big enough for the two towering egos of billionaire Elon Musk and President Donald Trump, and now they’re duking it out publicly, albeit from their own separate corners of the web.\nMusk is taking to his own social media platform, X, to take jabs at Trump, and Trump is firing back on Truth Social and Fox News.\nThe squabble comes a few days after Musk stepped down from leading DOGE, and after Musk repeatedly disparaged Trump’s “Big, Beautiful Bill,” a spending package that House Republicans passed in May. Musk has called the bill “a disgusting abomination,” saying it would significantly increase the federal budget deficit by up to $3.8 trillion in additional debt over the next decade through increased defense spending, immigration enforcement measures, and tax cuts.\nIn a way, the siloed nature of this shouting match feels poetic. It exposes the cracks in the Musk-Trump political alliance and underscores how powerful social media and loyal fan bases have become in shaping policy narratives and swaying voter perception.\nTrump is doing what he often does, trying to discredit a potential rival. For Musk, it’s more of a gamble. Tesla has already taken a hit from his political grandstanding and flirtations with the Trump administration. More of the same could further damage his business. Or it could cement his status as an anti-establishment voice — a tech mogul who doesn’t need traditional power structures to influence the American political landscape.\nMusk has suggested in X posts that he would unseat politicians who backed Trump’s budget bill in the 2026 midterms. Pinned to the top of his X account is a poll asking if it’s “time to create a new political party in America that actually represents the 80% in the middle?” Two hours after the post, 82.3% of nearly 1 million voters said “yes.”\nMusk said just a couple weeks ago that he would be taking a step away from politics to focus on his businesses. And it’s those businesses that Trump seems keen to punish. On Truth Social, Trump accused Musk of going “CRAZY” because the administration “took away his EV mandate that forced everyone to buy Electric Cars that nobody wanted (that he knew for months I was going to do!).”\nSave $200+ on your TechCrunch All Stage pass\nBuild smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections.\nExhibit at TechCrunch Sessions: AI\nSecure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last.\nTrump, here, is referring to the EV tax credit under former President Joe Biden’s Inflation Reduction Act. There never was a mandate that forced anyone to buy EVs. Trump’s spending bill would end the tax credit by the end of this year.\nOn X, Musk countered that claim, and said he never had eyes on the bill before it passed the House.\nTrump also said that Musk blew up after the president refused to put someone Musk “knew very well to run NASA” because he didn’t think it would be “appropriate.” He suggested that the easiest way to save money in the federal budget, “billions and billions of dollars,” would be to “terminate Elon’s governmental subsidies and contracts.”\nMusk’s businesses have been awarded at least $38 billion in government contracts, loans, subsidies, and tax credits over the next two decades, with nearly two-thirds pledged in the last five years, per a February Washington Post report.\nAxios reported Wednesday part of Musk’s frustration with Trump’s spending bill and the administration at large was failing to win favorable treatment for his ventures. Not coincidentally, Musk spent more than $260 million to get Trump elected.\nAs the fight between Musk and Trump develops, it’s starting to get personal.\n“Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate,” Musk posted in response to a video of Trump throwing shade at Musk on Fox News. “Such ingratitude.”\nA few hours later, Musk decided to drop “the really big bomb.”\n“[Donald Trump] is in the Epstein files,” Musk wrote on X. “That is the real reason they have not been made public. Have a nice day, DJT!”\nA number of politicians, including Republican senators, have called for Trump to release government files on financier Jeffrey Epstein, who was implicated in a child sex abuse ring and later committed suicide.\nMusk said that his aerospace company, SpaceX, would begin decommissioning its Dragon spacecraft “immediately” in response to Trump’s threat to cancel contracts awarded to the billionaire’s companies. (NASA uses Dragon for some missions.) And in a reply to a post on X about whether Trump should be impeached, Musk responded, “Yes.”"
    },
    {
      "title": "The Elon Musk and Donald Trump Breakup Has Started",
      "link": "https://www.wired.com/story/elon-musk-donald-trump-breakup/",
      "summary": "Trumpworld insiders fear that Elon Musk’s attacks on Donald Trump’s “Big Beautiful Bill” could kill it—and are already advising candidates to turn their backs on the world’s richest man.",
      "source": "https://www.wired.com/feed/rss",
      "category": "world",
      "confidence": 0.5055969953536987,
      "story_cluster": 0,
      "full_text": "Elon Musk may have finally reached the end of his rope with President Donald Trump—and vice versa. While the world’s richest man wars with the US president on X, Republican strategists and insiders in Trumpworld tell WIRED that Musk’s broader future in Republican politics is on shaky ground.\nOver the past few days on X, Musk has posted increasingly personal criticisms at Trump and the Republican budget reconciliation package known as the Big Beautiful Bill. This came to a head on Thursday, when Trump addressed the relationship during a press conference with German chancellor Friedrich Merz.\n“Elon and I had a great relationship. I don’t know if we will anymore,” said Trump, who compared Musk to past aides who have, he said, developed “Trump derangement syndrome” after leaving his administration.\nTrump and Musk have been in lockstep since Musk endorsed the president in July 2024. Musk poured hundreds of millions of dollars into Trump’s reelection bid, and their close relationship has been promoted by the pair countless times. Just last week, the two held a joint press conference as an apparent celebration of and conclusion to Musk’s time as a special government employee involved with his so-called Department of Government Efficiency (DOGE).\nToday’s remarks, though, reveal how fractured that relationship has become. “Without me, Trump would have lost the election,” Musk posted on X shortly after Trump’s comments. “Dems would control the House and the Republicans would be 51-49 in the Senate.”\nBehind the scenes, Trumpworld Republicans tell WIRED, this tension is about more than just a bromance falling apart. If Musk continues to escalate, he may drag down legislation that Trump sees as a key part of his political legacy.\n“If [Musk] actually successfully gets any votes switched to tank this bill and kills it,” a senior Trumpworld strategist tells WIRED, “then I think at that point he’s fucking dead to Donald Trump.”\nThis Republican—who, like the four WIRED spoke to for this story, requested anonymity to keep what’s left of their political futures alive after the current implosion of the Trump-Musk relationship—went on to say that Musk meddling in the Big Beautiful Bill came at the worst time and with the highest stakes for the Trump White House.\nAt best, they say, Trump has “18 months” to cement his legacy with his signature legislation. “Some of the priorities of President Trump are not possible outside of this bill.” After that, this same senior Republican said, the remainder of Trump’s term will likely be hamstrung by an expected Democratic victory in the House in the midterms that would prevent any major legislative wins.\n“Whatever,” Musk tweeted minutes after Trump’s comment about their relationship and the president’s claims that Musk was only upset about the potential impact to his automotive business. “Keep the EV/solar incentive cuts in the bill, even though no oil & gas subsidies are touched (very unfair!!), but ditch the MOUNTAIN of DISGUSTING PORK in the bill. In the entire history of civilization, there has never been legislation that (sic) both big and beautiful. Everyone knows this! Either you get a big and ugly bill or a slim and beautiful bill. Slim and beautiful is the way.” Musk has continued posting, attacking, he says, what he believes is Trump’s about-face on raising the debt ceiling.\nAccording to the nonpartisan Congressional Budget Office, the package would increase the deficit by $2.4 trillion through 2034, mostly due to an anticipated $3.7 trillion decline in revenue due to the extension of tax cuts passed during Trump’s first term. The package would cut spending by about $1.3 trillion, with most of that coming from cuts to Medicaid and food assistance. Other spending would decline by about $64 billion on net, the CBO has written, with cuts offset by “increases in outlays for defense, immigration enforcement, and homeland security.” Because the package would increase the deficit, it would necessitate increasing the debt ceiling—something Trump has said he would like to do away with entirely.\n“Elon was ‘wearing thin,’ I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY!” Trump later wrote on Truth Social before threatening to cancel Musk’s government contracts.\nRepublicans familiar with the dynamic between Trump and Musk said several recent flash points have brought the two men closer to the brink. The most notable were Musk’s reported outrage at Trump’s announcement that he was withdrawing the nomination of Jared Isaacman, a Musk ally, for Nasa administrator. The Big Beautiful Bill, if passed, would also cut the electric vehicle tax credit that benefits companies like Tesla.\n“If this really is a divorce and they start butting heads,” a second senior Republican strategist plugged into Trumpworld tells WIRED, “it doesn’t take much for Trump to put out a Truth Social post that undermines what Elon’s trying to do.”\n| Got a Tip? |\n|---|\n| Do you know anything about Elon Musk's future in the government? We'd like to hear from you. Using a nonwork phone or computer, contact the reporter securely on Signal at Leak2Lahut.26. |\nTwo of the Trumpworld Republican strategists WIRED spoke with who have clients on Capitol Hill—including senators facing reelection—said that even before Thursday’s outburst, Musk had become so toxic that even his seemingly endless funds couldn’t change their outlook.\n“My advice to clients, many of which are in Congress in the Senate and seeking reelection, is to take the side of their voters and not the side of Elon Musk,” says the senior Republican strategist.\n“If you vote to basically throw your district under the bus,” the second Republican adds, “that means you're going to lose in November anyways.”\nFearing a midterm wipeout and a lingering, toxic drag on the GOP brand from Musk, Republicans who had been cautious in their approach to the world’s richest man are feeling increasingly emboldened to encourage their clients to break free.\n“You should not turn your back on promises made [to voters] just because Elon Musk is mad about it,” the first strategist says. “Unless Elon Musk spends a couple hundred million dollars going after people in these primaries, that is not going to have the impact that people think he does, because Donald Trump is still more popular than anybody else in the party. And if you're on the side of Donald Trump, then ultimately you're going to be OK.”\nThis story has been updated with details of a Truth Social post from President Donald Trump."
    }
  ],
  "business": [
    {
      "title": "Trump confirms China trip after 'very good' call with Xi",
      "link": "https://www.bbc.com/news/articles/c0qg23gqllwo",
      "summary": "The leaders of the US and China agree to further talks aimed at reaching a deal amid an ongoing trade war.",
      "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
      "category": "business",
      "confidence": 0.34774550795555115,
      "story_cluster": 1,
      "full_text": "Trump confirms China trip after 'very good' call with Xi\nDonald Trump has said he will visit China after speaking to its leader Xi Jinping over the phone.\nThe US president said he had reciprocated with an invite to the White House during the \"very good talk\" - though such a trip has not been confirmed by either side.\nThursday's call is the first time the two leaders have spoken since Trump launched a trade war with Beijing in February. Chinese state media reported that the call happened at the White House's request.\nTrump wrote on social media that the hour-and-a-half conversation was primarily focused on trade and had \"resulted in a very positive conclusion for both countries\".\n\"He invited me to China and I invited him here,\" Trump said of the call with Xi while meeting German Chancellor Friedrich Merz in the Oval Office.\n\"We both accepted, so I will be going there with the first lady at a certain point and he will be coming here hopefully with the first lady of China.\"\nThe Chinese readout of the conversation mentioned the its invitation but not the reciprocal one to the White House.\nAccording to Chinese state news agency Xinhua, Xi reportedly told Trump that the US should \"withdraw the negative measures it has taken against China\".\nThe Chinese leader was also said to have told Trump that China always kept its promises and since a consensus had been reached, both sides should abide by it - a reference to a recent deal between the two nations struck in Geneva.\nBoth sides have accused the other of breaching the deal aimed at dramatically reducing trade tariffs - a deal Trump touted as a \"total reset\".\nIt came after Trump raised tariffs on imports from a number of countries, but reserved the highest rates for China. Beijing responded with its own higher rates on US imports, sparking tit-for-tat increases that peaked at 145%.\nThe tentative truce struck in May brought that US tariff on Chinese products down to 30%, while Beijing slashed levies on US imports to 10% and promised to lift barriers on critical mineral exports.\nThe agreement gave both sides a 90-day deadline to try to reach a trade deal.\nBut since then, talks have seemed to grind to a halt amid claims on both sides that the deal had been breached.\nThe US has accused China of failing to restart shipments of critical minerals and rare earth magnets vital to car and computer industries.\nThe Chinese Ministry of Commerce has denied the claims and accused the US of undermining the deal by introducing new restrictions on computer chips.\nTrump introduced new export restrictions on semiconductor design software and announced it would revoke the visas of Chinese students.\nThe US president said following the call that \"there should no longer be any questions respecting the complexity of Rare Earth products\".\nHe told reporters in the White House: \"Chinese students can come, no problem, no problem - its an honour to have them frankly. But we want to check them.\"\nChinese state media reported that Xi warned Washington that it should handle Taiwan \"with caution\" to avoid conflict, just days after US Defence Secretary Pete Hegseth said China posed an \"imminent\" threat to the self-governed island.\nHegseth told the Shangri-la Dialogue in Singaport that Beijing was \"credibly preparing to potentially use military force to alter the balance of power\".\nChina sees Taiwan as a breakaway province that will eventually be reunified, and has not ruled out the use of force to achieve this. The US supports Taiwan militarily but does not officially recognise it due to the \"One China\" policy.\nAccording to the readout of Thursday's call given to Chinese media, Xi stressed that the US should handle the \"Taiwan issue prudently to prevent a small number of Taiwan Independence separatists from dragging China and the US into a dangerous situation of conflict and confrontation\".\nThe call between Trump and Xi is long awaited and comes after months of silence between the two leaders.\nThe White House has touted the possibility they might talk from week one of Trump's presidency - and earlier this week he finally vented his frustration on social media.\nTrump wrote: \"I like President Xi of China, always have, and always will, but he is VERY TOUGH, AND EXTREMELY HARD TO MAKE A DEAL WITH!\"\nTrump has made it clear that he likes to be involved in negotiations. But this is not the way China does business.\nBeijing prefers to appoint a negotiating team led by a trusted official. Any calls or meeting between heads of state are usually thoroughly planned and highly choreographed.\nThe Chinese will also not want to be seen to bend to Washington's demands."
    },
    {
      "title": "US-China trade talks to move forward after Trump-Xi call",
      "link": "https://www.dw.com/en/us-china-trade-talks-to-move-forward-after-trump-xi-call/a-72807211?maca=en-rss-en-all-1573-rdf",
      "summary": "The US president said he spoke with Chinese leader Xi Jinping and accepted an invitation to China. He added US and Chinese trade negotiating teams will be meeting soon.",
      "source": "https://rss.dw.com/rdf/rss-en-all",
      "category": "business",
      "confidence": 0.35834264755249023,
      "story_cluster": 1,
      "full_text": "US-China trade talks to move forward after Trump-Xi call\nJune 5, 2025US President Donald Trump said he had a \"very good phone call\" with China's President Xi Jinping on Thursday.\nIn comments posted on his Truth Social platform, Trump said \"some of the intricacies of our recently made, and agreed to, Trade Deal\" had been discussed.\nThe US president said the call lasted around one and a half hours and \"resulted in a very positive conclusion for both Countries.\"\nTrump invited to China\nTrump said Xi \"graciously invited\" him and the first lady to visit China, to which he \"reciprocated.\"\n\"As Presidents of two Great Nations, this is something that we both look forward to doing,\" Trump said.\nTrump also made reference to the call during a meeting with German Chancellor Friedrich Merz in the Oval Office and confirmed that he would be making a visit to China.\n\"He invited me to China and I invited him here, we both accepted. So, I will be going there with the first lady at a certain point and he will be coming here, hopefully with the first lady of China, \" Trump said.\nUS-China trade talks\nUS and Chinese teams would be meeting \"shortly\" at a yet to be determined location the US leader said and would involve Secretary of the Treasury Scott Bessent, Secretary of Commerce Howard Lutnick, and US Trade Representative, ambassador Jamieson Greer.\nTrump emphasized that talks had focused almost entirely on trade with no discussions relating to Russia, Ukraine or Iran.\nThe call comes amid a 90-day tariff truce that came into effect last month which paused a spiraling trade war between the world's two largest economies.\nTrump has lowered his 145% tariffs on Chinese goods to 30% for 90 days to allow for talks while China also reduced its taxes on US goods from 125% to 10%.\nEdited by: Wesley Rahn"
    }
  ],
  "health": [
    {
      "title": "'Neglected tropical diseases' now face even more neglect",
      "link": "https://www.npr.org/sections/goats-and-soda/2025/06/05/g-s1-70255/neglected-tropical-diseases-usaid-cuts-pharmaceuticals",
      "summary": "U.S. aid cuts could jeopardize the supply of donated drugs that are hailed for their effectiveness in combating neglected diseases like river blindness, schistosomiasis and trachoma.",
      "source": "https://feeds.npr.org/1001/rss.xml",
      "category": "health",
      "confidence": 0.7070766687393188,
      "story_cluster": 2,
      "full_text": "'Neglected tropical diseases' now face even more neglect\nFor close to two decades, the U.S. Agency for International Development has partnered with countries around the world to combat neglected tropical diseases, or NTDs. The term refers to a group of diseases that affect more than a billion people, causing severe pain, disfigurement, disability and in some cases death.\nThey're referred to as \"neglected\" because they disproportionately affect populations living in extreme poverty and thus don't attract investment from the pharmaceutical industry.\nNow, as part of sweeping cuts to foreign aid that began on Inauguration Day, the Trump administration has frozen $114.5 million appropriated by Congress for the NTD Program's 2025 budget. If that funding isn't restored, advocates say, nearly a billion dollars' worth of medicines donated by private pharmaceutical companies is likely to go undelivered or expire.\nThat's according to a statement submitted to Congress by the Neglected Tropical Diseases Roundtable, a U.S. nonprofit organization that advocates for the control and elimination of these diseases worldwide.\nNTDs are parasitic and bacterial diseases that typically have complex, unfamiliar names — like \"onchocerciasis,\" \"lymphatic filariasis,\" \"schistosomiasis,\" and \"human African trypanosomiasis,\" to list just a few of the 21 NTDs prioritized by the World Health Organization.\nRecognized by researchers as one of the most cost-effective interventions in global health, the control and elimination of NTDs accounts for a minute portion of U.S. foreign assistance — less than 1%. But that funding has had a major impact, primarily because private pharmaceutical companies have donated billions of dollars' worth of drugs on the condition that USAID covers the cost of distributing them. Indeed, to date the USAID NTD Program has delivered more than 3.3 billion treatments to more than 1.7 billion people. It has helped 14 countries eliminate at least one NTD and put 15 other countries on track to do so within the next five years.\nNow that the program has been eliminated, advocates fear those lifesaving drugs may not reach the communities that need them.\n\"The pharmaceutical firms guarantee delivery of the drug to a country's storehouse, but then it's up to the country and the [nonprofit] partners to figure out how to distribute it,\" said Darin Evans, a former contractor with USAID. \"And the big question now is how to get the drug that is already sitting in warehouses out into the field — to the communities that need it.\"\nAdvocates also worry that the pharmaceutical firms that manufacture the drugs could decide to revisit their commitments and potentially halt production entirely. \"The reality is that when we go, the NTD donor space will collapse,\" said a former USAID staffer who asked to remain anonymous, fearing retribution from the Trump administration. \"We're talking complete collapse.\"\nThe USAID NTD Program was created in 2006 when Congress appropriated $15 million for the scale-up and integration of control efforts targeting five of the most common NTDs. Researchers with the Bill and Melinda Gates Foundation wrote in a 2011 book about NTDs that the program was so effective within its first few years that it \"resulted, even with a change in administration, in a significant increase in U.S. government investment.\" (The Gates Foundation is a sponsor of NPR and this blog.)\nThe lynchpin of this success, advocates say, has been the outsized contribution by pharmaceutical firms of free medicines to ministries of health in countries where these NTDs are a heavy burden. That includes 880 million treatments valued at $975 million slated for distribution in 2025. \"I don't know of any other health program where the pharmaceutical [companies] have stepped up like this,\" Rep. Chris Smith, R-N.J., said in 2019 as he urged his colleagues to pass the End Neglected Tropical Diseases Act.\nThat law was passed and reiterated U.S. government support for distribution of the donated drugs, as well as mapping and surveillance of cases, spraying for mosquitoes and other vectors of disease transmission, and integrating efforts to target multiple NTDs, many of which can be addressed simultaneously.\nThat public-private partnership has proven to be so cost-effective that it's described by the Centers for Disease Control and Prevention as one of the \"best buys\" in global health. \"Every $1 invested in NTDs by the U.S. government leverages $26 in donated treatments,\" according to the CDC, which develops global policy and guidelines for NTD control programs and conducts research aimed at improving diagnostic tests and other tools. According to the NTD Roundtable, U.S. support has led to more than $32 billion in donated medicines to date.\nThe former USAID staffer said that for years, Rep. Smith was a passionate champion of the bill in the House. \"Now he's not saying anything,\" they said. \"Republicans started this program and now Republicans are trashing it.\" Smith's congressional office did not respond to a request for comment for this article.\nA model for public health programs\nThe global fight against NTDs began in earnest in 1974, when USAID joined other donors and national governments in establishing the Onchocerciasis Control Program. Spearheaded by the World Bank, the program aimed to rid areas of the black flies that transmit river blindness, or onchocerciasis, an ancient scourge caused by parasitic worms that can rob people of their sight. For years, that effort focused primarily on aerial spraying of the fast-flowing rivers and streams where the black flies breed.\nAt the time, river blindness affected an estimated 37 million people worldwide, with prevalence rates of up to 80% in large parts of West Africa. Scientists reported that in the most highly affected areas, 1 in 10 adults had been blinded by the disease and more than 1 in 3 suffered visual impairment, along with agonizing itching caused by an immune response to dead or dying worms. With few able-bodied persons left to tend the fields, food shortages forced villagers to abandon the fertile farmland in fly-infested river valleys and relocate to higher ground.\nDr. William H. Foege, a former director of the CDC who is credited with devising the global strategy that led to the eradication of smallpox in the 1970s, recalled living in villages in Nigeria where river blindness was endemic. \"I would see people constantly scratching,\" he said, adding that the itching was, for many people, \"the first thing they knew in the morning and the last thing they knew before they fell asleep.\"\nThen came a breakthrough. A 1982 study in Senegal showed that a single dose of the antiparasitic drug ivermectin could be used to safely treat river blindness, stopping the itching and preventing blindness. Manufactured by Merck under the brand name Mectizan, ivermectin was originally developed to deworm livestock and pets. But Merck researchers suspected it might also work in humans. Though he knew the drug would never turn a profit, Roy Vagelos, then the company's chief executive, approved a budget for research and development.\nSeveral years and millions of dollars later, Mectizan was approved for human use and Vagelos approached Foege, then head of the Atlanta-based nonprofit Task Force for Child Survival (now the Task Force for Global Health), with a proposal: Merck would donate Mectizan — \"as much as needed, for as long as needed\" — if the task force could devise a system to distribute the drug to affected communities in remote rural areas. Mectizan works by killing the juvenile worms that cause symptoms. However, because it doesn't kill the adult worms that produce the larvae, the drug has to be administered every six to 12 months for up to 15 years, the lifespan of the adult worm.\nThus was born the Mectizan Donation Program, the longest-running philanthropic program of its kind, which has helped five countries eliminate river blindness — including, most recently, the West African nation of Niger.\nThe program pioneered a model for combatting NTDs and other infectious diseases. In the nearly four decades since its launch in 1987, similar public-private partnerships have emerged to treat trachoma, which causes blindness; lymphatic filariasis (or elephantiasis); schistosomiasis, a parasitic infection that can cause liver damage; and intestinal parasites in children. Together, these programs reach more than a billion people per year in low-income countries through a strategy known as mass drug administration, whereby everyone in a given area is treated — even if they aren't sick or infected.\nIn addition to helping eliminate the various target diseases, mass drug administration has yielded important collateral public health benefits. \"We've actually been knocking off these diseases we didn't expect,\" said Dr. Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine and co-director of the Texas Children's Hospital Center for Vaccine Development. Studies have shown, for example, that mass administration of ivermectin reduces the prevalence of scabies, the prevalence of African eye worm (loiasis), and the spread of malaria.\n\"And then there's this really extraordinary observation of declines in overall child mortality,\" says Hotez. Indeed, University of California San Francisco-led research supported by the Bill & Melinda Gates Foundation has shown that a twice-yearly dose of azithromycin for the elimination of trachoma, a blinding eye disease, is associated with a 14% reduction in deaths among children under 5.\nHotez, who has long crusaded against parasitic worms and co-authored the 2005 paper that rebranded them as \"neglected tropical diseases,\" worked closely with the George W. Bush White House and members of Congress to secure the initial $15 million in funding for the USAID program.\n\"The support for it was so bipartisan,\" he says. \"I would literally go from talking about NTDs at a prayer breakfast with Sam Brownback, the very conservative Republican senator from Kansas, to the office of [Democratic] Senator [Patrick] Leahy, and they would work together on it, and it wasn't a big deal because the program is so cost-effective and it was so obvious that we should fund it.\"\nDecades of progress in peril\nNow those hard-won gains are at risk of unraveling.\n\"It's a very long, intensive process to get rid of [river blindness],\" said Evans. More than 99% of cases of river blindness occur in sub-Saharan Africa, where a number of countries are nearing elimination. While Niger is the only African country to be declared free of river blindness to date, \"others — Mali, Senegal, Burkina Faso, Tanzania — are getting close,\" Evans said. \"Now we stand to lose 40-plus years of investment toward achieving that goal.\"\nThis year the USAID NTD Program, with a budget of $114 million, had planned to distribute roughly 200 million doses via mass drug administration campaigns. About half of those were to be tablets of Mectizan, which is also used to eliminate lymphatic filariasis, a painful parasitic disease. Also known as elephantiasis, the disease can lead to abnormal enlargement of body parts, including legs, feet, toes and genitals, making it difficult for people to move or walk.\nIn a statement to NPR, a State Department spokesperson said USAID's NTD program was determined \"to not fit within the standards laid out by Secretary Rubio for U.S. foreign assistance, which must make the United States stronger, safer, or more prosperous.\" The department spokesman added that supporting U.S. national security and U.S. interests \"requires an agile approach. We will continue to make changes as needed.\"\nStill, advocates remain hopeful that funding will be restored. They warn that pausing treatment will only perpetuate the problem, prolong the fight, and add to the cost. Indeed, missed rounds of mass drug administration can lead NTDs to bounce back, increasing the amount of drug needed to achieve success.\n\"What's frustrating is that, in so many places, we were on the brink of elimination,\" said Angela Weaver, vice president of NTDs at Helen Keller Intl, a nonprofit that had been supporting USAID-funded efforts to control lymphatic filariasis and trachoma in six countries in West Africa. \"The cuts to USAID not only jeopardize this progress, they also risk wasting the investments made to date.\" Weaver, who helped launch USAID's NTD Program in 2006, says that one of the principal aims of the program in the early years was to identify the most effective and efficient strategies. \"We spent a lot of time demonstrating to Congress the cost-effectiveness of the program — how we integrated different disease-specific control activities and how we scaled them up.\"\nWeaver added that as funding increases allowed the program to expand to more countries, USAID's pharmaceutical partners increased their production capacity to meet the growing need for donated drugs. \"It was unbelievable,\" she says. \"What other program can go to a country and say hey, we have all of these drugs to treat these terrible diseases you have, and they're free?\" To see the program eliminated in the name of cutting waste, fraud and abuse has been \"devastating,\" she says. \"This is about the most vulnerable people in the poorest parts of the world that just want access to basic medication.\"\nIronically, one of the canceled USAID contracts was a $45 million grant to support African governments and institutions in taking over the critical research needed to strengthen NTD elimination efforts in their respective countries. \"Benjamin Rush, the great physician during the Revolutionary War, once said that national crimes require national punishments,\" said Foege. \"I think destroying USAID is a national crime, and it's clear to me that, as an American, I'm now part of that crime.\"\nPatrick Adams is a freelance journalist based in Atlanta."
    }
  ],
  "science": [
    {
      "title": "Decades-old assumptions about brain plasticity upended",
      "link": "https://www.sciencedaily.com/releases/2025/06/250603172903.htm",
      "summary": "A new study challenges a decades-old assumption in neuroscience by showing that the brain uses distinct transmission sites -- not a shared site -- to achieve different types of plasticity.",
      "source": "https://www.sciencedaily.com/rss/all.xml",
      "category": "science",
      "confidence": 0.8567355871200562,
      "story_cluster": 1,
      "full_text": "Decades-old assumptions about brain plasticity upended\n- Date:\n- June 3, 2025\n- Source:\n- University of Pittsburgh\n- Summary:\n- A new study challenges a decades-old assumption in neuroscience by showing that the brain uses distinct transmission sites -- not a shared site -- to achieve different types of plasticity.\n- Share:\nA new study from Pitt researchers challenges a decades-old assumption in neuroscience by showing that the brain uses distinct transmission sites -- not a shared site -- to achieve different types of plasticity. The findings, published in Science Advances, offer a deeper understanding of how the brain balances stability with flexibility, a process essential for learning, memory and mental health.\nNeurons communicate through a process called synaptic transmission, where one neuron releases chemical messengers called neurotransmitters from a presynaptic terminal. These molecules travel across a microscopic gap called a synaptic cleft and bind to receptors on a neighboring postsynaptic neuron, triggering a response.\nTraditionally, scientists believed spontaneous transmissions (signals that occur randomly) and evoked transmissions (signals triggered by sensory input or experience) originated from one type of canonical synaptic site and relied on shared molecular machinery. Using a mouse model, the research team -- led by Oliver Schlüter, associate professor of neuroscience in the Kenneth P. Dietrich School of Arts and Sciences -- discovered that the brain instead uses separate synaptic transmission sites to carry out regulation of these two types of activity, each with its own developmental timeline and regulatory rules.\n\"We focused on the primary visual cortex, where cortical visual processing begins,\" said Yue Yang, a research associate in the Department of Neuroscience and first author of the study. \"We expected spontaneous and evoked transmissions to follow a similar developmental trajectory, but instead, we found that they diverged after eye opening.\"\nAs the brain began receiving visual input, evoked transmissions continued to strengthen. In contrast, spontaneous transmissions plateaued, suggesting that the brain applies different forms of control to the two signaling modes.\nTo understand why, the researchers applied a chemical that activates otherwise silent receptors on the postsynaptic side. This caused spontaneous activity to increase, while evoked signals remained unchanged -- strong evidence that the two types of transmission operate through functionally distinct synaptic sites.\nThis division likely enables the brain to maintain consistent background activity through spontaneous signaling while refining behaviorally relevant pathways through evoked activity. This dual system supports both homeostasis and Hebbian plasticity, the experience-dependent process that strengthens neural connections during learning.\n\"Our findings reveal a key organizational strategy in the brain,\" said Yang. \"By separating these two signaling modes, the brain can remain stable while still being flexible enough to adapt and learn.\"\nThe implications could be broad. Abnormalities in synaptic signaling have been linked to conditions like autism, Alzheimer's disease and substance use disorders. A better understanding of how these systems operate in the healthy brain may help researchers identify how they become disrupted in disease.\n\"Learning how the brain normally separates and regulates different types of signals brings us closer to understanding what might be going wrong in neurological and psychiatric conditions,\" Yang said.\nStory Source:\nMaterials provided by University of Pittsburgh. Original written by Brandie Jefferson. Note: Content may be edited for style and length.\nJournal Reference:\n- Yue Yang, Man Ho Wong, Xiaojie Huang, Delia N. Chiu, Yu-Zhang Liu, Vishnu Prabakaran, Amna Imran, Elisa Panzeri, Yixuan Chen, Paloma Huguet, Alexander Kunisky, Jonathan Ho, Yan Dong, Brett C. Carter, Weifeng Xu, Oliver M. Schlüter. Distinct transmission sites within a synapse for strengthening and homeostasis. Science Advances, 2025; 11 (15) DOI: 10.1126/sciadv.ads5750\nCite This Page:"
    }
  ]
}